---
type: HermiteSpline
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# HermiteSpline

`Autodesk.Revit.DB.HermiteSpline` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Property | ControlPoints | — | `public IList < XYZ > ControlPoints { get ; set ; }` |
| Property | IsPeriodic | — | `public bool IsPeriodic { get ; }` |
| Property | Parameters | — | `public DoubleArray Parameters { get ; }` |
| Property | Tangents | — | `public IList < XYZ > Tangents { get ; }` |